Repository: elearning-ostfalia/Ostfalia-Praktomat
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: de

source: Personal info
de: Personelle Info

source: Permissions
de: Rechte

source: Groups
de: Gruppen

source: Important dates
de: Wichtige Termine

source: A user with that username already exists.
de: Es gibt schon einen Benutzer mit dem Namen.

source: Account activation on %s
de: Konto für %s wird aktiviert

source: The tutorial the student belongs to.
de: Die Übungsgruppe des Studenten.

source: The final grade for the whole class.
de: Die Zensuren für den ganzen Kurs.

source: activation key
de: Aktivationsschlüssel

source: The name of the tutorial
de: Der Name der Übungsgruppe

source: The tutors in charge of the tutorium.
de: Die Tutoren der Übungsgruppe

source: Tutors
de: Tutoren

source: Comment which is shown to the user.
de: Kommentar für den Benutzer

source: Comment which is only visible to tutors
de: Kommentar (nur für Tutoren)

source: The mark for the whole solution.
de: Die Zensur für die ganze Lösung.

source: Determines the order in wich the checker will start. Not necessary continuously!
de: Bestimmt die Reihenfolge, in welcher die Checker ablaufen.

source: Test results are displayed to the submitter.
de: Ergebnisse werden dem Einreicher gezeigt.

source: The test must be passed to submit the solution.
de: Der Test muss bestanden sein um die Lösung einreichen zu können.

source: The test will run on submission time.
de: Der Test läuft zur Zeit der Einreichung.

source: Indicates whether the test has been passed
de: Zeigt ob der Test bestanden wurde

source: Text result of the checker
de: Resultat des Checkers

source: Name to be displayed on the solution detail page.
de: Name, welcher auf der Lösungszeite gezeigt wird.

source: XML configuration of CheckStyle. See http://checkstyle.sourceforge.net/
de: XML Konfiguration von CheckStyle. See http://checkstyle.sourceforge.net/

source: The file that is copied into the sandbox
de: Die Datei, die in den Sandkasten kopiert wird

source: What the file will be named in the sandbox. If empty, the name the file is stored under on the webserver is used!
de: Der Dateiname, der im Sandkasten benutzt wird. Falls leer, wird der Name, unter dem die Datei auf dem Webserver gespeichert wird, benutzt.

source: Subfolder in the sandbox which shall contain the file.
de: Unterordner im Sandkasten, welcher die Datei enthalten wird.

source: The name of the Test
de: Der Testname

source: The name of the interface that must be implemeted.
de: Der Name des Interface, das implementiert werden soll.

source: The fully qualified name of the Testcase class
de: Der volle Name der Testfalldatei

source: Description of the Testcase. To be displayed on Checker Results page when checker is unfolded.
de: Beschreibung des Testfalls, der auf der Ergebnisseite nach Expandieren gezeigt wird.

source: Name of the Testcase. To be displayed as title on Checker Results page
de: Name des Testfalls, der auf der Ergebnisseite gezeigt wird.

source: The maximum length of a line of code.
de: Die maximale Codelänge

source: The amount of characters a tab represents.
de: Die Anzahl der Zeichen welche einem Tab entspricht.

source: Regular expression describing the filenames to be checked. Case Insensetive. Blank: use all files.
de: Regulärer Ausdruck der zu untersuchenden Dateinamen. Groß-/Kleinschreibung wird ignoriert. Leer: alle Dateien werden untersucht.

source: Regular expression describing included filenames, which shall be excluded. Case Insensetive. Blank: use all files.
de: Regulärer Ausdruck der nicht zu untersuchenden Dateinamen. Groß-/Kleinschreibung wird ignoriert. Leer: alle Dateien werden untersucht.

source: Regular expression describing passages to be removed from the output.
de: Regulärer Ausdruck für Passagen, die entfernt werden sollen.

source: The text you search in the text
de: Der Text, nach dem gesucht wurde

source: The allowed max. occurrence of text in the source. 0 means the word is not allowed
de: Wie oft der Text maximal vorkommen darf. 0 heißt 'nicht erlaubt'

source: The file of type %s is not supported.
de: Der Dateityp %s ist nicht zulässig.

source: The zip file seams to be corrupt.
de: Die Zipdatei scheint defekt zu sein.

source: The zip file is to big.
de: Die Zipdatei ist zu groß.

source: The file '%(file)s' of guessed mime type '%(type)s' in this zip file is not supported.
de: Die Datei '%(file)s' vom erwarteten Mimetyp '%(type)s' in dieser Zipdatei ist nicht zulässig.

source: Uhoh - something unexpected happened.
de: Autsch - etwas Unerwartetes ist passiert.

source: The file '%(file)s' is bigger than %(size)iKB which is not suported.
de: Die Datei '%(file)s' ist größer als die erlaubten %(size)iKB

source: You must at least choose one file.
de: Mindestens eine Datei muss ausgewählt werden.

source: Access denied
de: Zugriff verboten

source: Welcome,
de: Hallo

source: Change Account
de: Konto wechseln

source: Log-out
de: Abmelden

source: Rating overview
de: Bewertungsübersicht

source: Admin Panel
de: Administration

source: My Tutorial
de: Meine Übungsgruppe

source: Login
de: Anmelden

source: Register
de: Registrieren

source: User site
de: Nutzersicht

source: Hello
de: Hallo

source: your solution to the task "%(task)s" has been attested by %(attester)s.
de: Ihre Lösung für Aufgabe "%(task)s" wurde von %(attester)s bewertet.

source: Thanks for using our site!
de: Danke für Ihren Besuch!

source: The %(site_name)s team
de: Das %(site_name)s Team

source: Attestations
de: Bewertungen

source: The task is not yet expired.
de: Die Frist für die Aufgabe ist noch nicht abgelaufen.

source: Not all checker have yet been run.
de: Es sind noch nicht alle Checker ausgeführt wurden.

source: Attestation Progress by Tutor
de: Bewertungs-Fortschritt des Tutors

source: Unatested solutions
de: Noch nicht bewertete Lösungen

source: My attestations
de: Meine Bewertungen

source: Marked as Plagiarism
de: Als Plagiat bewertet

source: Attestations by other tutors
de: Bewertungen von anderen Tutoren

source: Attestation
de: Bewertung

source: Annotated Files
de: Annotierte Dateien

source: Rating Overview
de: Bewertungsübersicht

source: Statistics
de: Statistiken

source: No Tutorial
de: Keine Übungsgruppe

source: Password change
de: Passwort ändern

source: Password change successful
de: Änderung des Passworts war erfolgreich

source: Your password was changed.
de: Das Passwort wurde geändert.

source: Please enter your old password, for security's sake, and then enter your new password twice so we can verify you typed it in correctly.
de: Bitte erst das alte Passwort und dann zweimal das neue eingeben.

source: Old password:
de: Altes Passwort

source: New password:
de: Neues Passwort

source: Confirm password:
de: Passwort bestätigen

source: Change my password
de: Passwort ändern

source: Password reset
de: Passwort zurücksetzen

source: Password reset complete
de: Zurücksetzung des Passworts ist abgeschlossen

source: Your password has been set. You may go ahead and log in now.
de: Das Passwort wurde registriert. Sie können sich jetzt anmelden.

source: Log in
de: Anmelden

source: Enter new password
de: Neues Passwort eingeben

source: Please enter your new password twice so we can verify you typed it in correctly.
de: Bitte das neue Passwort zweimal eingeben

source: Password reset unsuccessful
de: Zurücksetzung des Passworts hat nicht funktioniert

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
de: Der Link zum Zurücksetzen des Passworts war nicht gültig. Vielleicht wurde er schon anderwertig benutzt. Bitte fordern Sie die Zurücksetzung nochmals an.

source: Password reset successful
de: Zurücksetzung des Passworts hat funktioniert

source: We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.
de: Wir haben Ihnen eine Email mit weiteren Anweisungen geschickt.

source: You're receiving this e-mail because you requested a password reset
de: Sie erhalten diese Email, da Sie die Zurücksetzung des Passworts angefordert hatten.

source: for your user account at %(site_name)s
de: Für Ihr Benutzerkonto im %(site_name)s

source: Please go to the following page and choose a new password:
de: Bitte rufen Sie folgende Seite auf und wählen Sie ein neues Passwort:

source: Your username, in case you've forgotten:
de: Ihr Benutzername (falls Sie ihn vergessen haben)

source: Forgotten your password? Enter your e-mail address below, and we'll e-mail instructions for setting a new one.
de: Vergessenes Passwort? Bitte geben Sie Ihre Email Adresse ein und wir schicken Ihnen Anweisungen für ein neues Passwort.

source: E-mail address:
de: Email Adresse:

source: Reset my password
de: Passwort zurücksetzen

source: Activation
de: Aktivieren

source: Activation successful,Activation unsuccessful
de: Aktivierung erfolgreich, nicht erfolgreich

source: You have successfully activated your account. You can now login.
de: Sie haben Ihr Konto erfolgreich aktiviert. Sie können sich nun anmelden.

source: Your activation has failed due to one of the folloing reasons:
de: Ihre Aktivierung hat nicht funktioniert, wegen:

source: The activation period of %(expiration_days)s days has expired.
de: Der Aktivierungszeitraum von %(expiration_days)s Tagen ist abgelaufen.

source: The activation code was allready succsessfully used. You may try to log in.
de: Der Aktivierungscode wurde schon erfolgreich verwendet. Bitte versuchen Sie sich anzumelden.

source: The activation code is invalid.
de: Der Aktivierungscode ist ungültig.

source: An account with the same matnumber was allready activated.
de: Ein Konto mit der gleichen Matrikelnummer wurde schon aktiviert.

source: Registration
de: Registrieren

source: Registration successful
de: Registrierung erfolgreich

source: We've e-mailed you instructions for activating your account to the e-mail address you submitted. You should be receiving it shortly.
de: Wir haben Ihnen eine Email mit weiteren Anweisungen geschickt.

source: You're receiving this e-mail because you registerd an account at %(site_name)s
de: Sie erhalten diese Email, da Sie ein Konto am %(site_name)s registriert haben.

source: Please go to the following page to activate your account within %(expiration_days)s days
de: Bitte rufen Sie folgende Seite auf und aktivieren Sie Ihr Konto innerhalb von %(expiration_days)s Tagen

source: Register a new Account
de: Neues Konto registrieren

source: passed, failed
de: Bestanden, Durchgefallen

source: %(solution.author)s's solutions
de: %(solution.author)s's Lösungen

source: My solutions
de: Meine Lösungen

source: Solution
de: Lösungen

source: as seen by
de: gesehen von

source: All required tests have been passed. Nevertheless there is at least one warning
de: Alle Tests wurden zwar bestanden, aber es gibt mindestens eine Warnung.

source: You should consider correcting it.
de: Sie sollten dies korrigieren.

source: All required tests have been passed.
de: Alle geforderten Tests wurden bestanden.

source: Not all required tests have been passed.
de: Nicht alle geforderten Tests wurden bestanden.

source: Please correct the errors below and try again!
de: Bitte korrigieren Sie die Fehler und versuchen Sie es noch einmal!

source: This is your current final solution.
de: Dies ist Ihre endgültige Lösung

source: This is NOT your current final solution.
de: Keine endgültige Lösung

source: You can resubmit this solution to make this your final solution
de: Sie können diese Lösung wieder hochladen und zur endgültigen Lösung machen

source: Results
de: Ergebnisse

source: Files
de: Dateien

source: Time left:
de: Vorhandene Zeit:

source: Upload solution
de: Lösung hochladen

source: upload
de: einreichen

source: The deadline has past. Therefore (re)submission is not possible.
de: Die Abgabefrist ist abgelaufen. Es können keine Dateien mehr hochgeladen werden.

source: Errors
de: Fehler

source: Warnings
de: Warnungen

source: No Warnings
de: Keine Warnungen

source: Attest
de: Bewertung

source: Final Solution
de: Endgültige Lösung

source: There is no final solution.
de: Keine endgültige Lösung

source: Solution History
de: Bisherige Einreichungen

source: No solutions have been uploaded.
de: Keine Lösung wurde eingereicht.

source: Please wait while your solution is examined
de: Bitte warten. Die Lösung wird untersucht

source: by
de: von

source: your solution to the task
de: Ihre Lösung für die Aufgabe

source: has been successfully uploaded
de: wurde erfolgreich hochgeladen

source: You can view your solution here
de: Sie können Ihre Lösung hier sehen

source: Your upload included these files
de: Ihre Einreichung schließt diese Dateien ein

source: Please keep this email and the files you have uploded to verify that you've completed the task.
de: Bitte behalten Sie diese Email und die hochgeladenen Dateien als Nachweis, dass Sie die Aufgabe beendet haben

source: Submission date
de: Abgabetermin

source: My Solutions
de: Meine Lösungen

source: Got Problems?
de: Probleme?

source: Your tutor
de: Ihr Tutor

source: Your trainer
de: Ihr Trainer

source: Expired tasks
de: Beendete Aufgaben

source: Upcoming tasks
de: Zukünftige Aufgaben

source: Solutions
de: Lösungen

source: Nothing to do right now! Yay!
de: Nichts zu tun!

source: Result Overview
de: Bewertungsübersicht

source: Task
de: Aufgabe

source: Grade
de: Bewertung

source: Rating Scale
de: Bewertungsskala

source: Final Grade
de: Zensur

source: Predicted Final Grade
de: Voraussichtliche Zensur
